Autodesk.Revit.DB.RenderDuration
An enumerated type containing possible duration types to do Raytracer render.
Since:
2017

Autodesk.Revit.DB.RenderDuration.UntilSatisfactory
Render until satisfactory.

Autodesk.Revit.DB.RenderDuration.ByTime
Render by the defined time.

Autodesk.Revit.DB.RenderDuration.ByLevel
Render by the defined iterations.